# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. Flávio Martins

### Grupo 45 - Turno BD2L19
<dl>
    <dt>5 horas (33.3%)</dt>
    <dd>ist1103902 Luís Pereira</dd>
    <dt>5 horas (33.3%)</dt>
    <dd>ist1103091 Pedro Curto</dd>
    <dt>5 horas (33.3%)</dt>
    <dd>ist1102664 Pedro Sousa</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- Employee(<u>ssn</u>, TIN, bdate, name)
    - UNIQUE(TIN)
- Workplace(<u>address</u>, lat, long)
    - UNIQUE(lat, long)
- Department(<u>name</u>)
- works(<u>ssn</u>, <u>address</u>, <u>name</u>)
    - ssn: FK(Employee)
    - address: FK(Workplace)
    - name: FK(Department)
- Office(<u>address</u>)
    - address: FK(Workplace)
- Warehouse(<u>address</u>)
    - address: FK(Workplace)
- Product(<u>sku</u>, name, description, price)
- Supplier(<u>TIN</u>, name, address, sku, date)
    - sku: FK(Product) NOT NULL
- EAN Product(<u>sku</u>, ean)
    - sku: FK(Product)
- delivery(<u>address</u>, <u>sku</u>, <u>TIN</u>)
    - address: FK(Workplace)
    - sku: FK(Product)
    - TIN: FK(Supplier)
- Customer(<u>cust_no</u>, name, email, phone, address)
    - UNIQUE(email)
- Order(<u>order_no</u>, date, cust_no)
    - cust_no: FK(Customer) NOT NULL
- process(<u>ssn</u>, <u>order_no</u>)
    - ssn: FK(Employee)
    - order_no: FK(Order)
- contains(<u>order_no</u>, <u>sku</u>, qty)
    - order_no: FK(Order)
    - sku: FK(Product)
- Sale(<u>order_no</u>, cust_no)
    - order_no: FK(Order)
    - cust_no: FK(Customer) NOT NULL

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

IC-1: Any ssn in Employee must exist in works.

IC-2: Any sku in Product must exist in Supplier. 

IC-3: Any order_no in Order must exist in contains.

IC-4: When a Workplace is removed it must also be removed from Office and/or Warehouse.

IC-5: When a Product is removed it must also be removed from EAN Product.

IC-6: When an Order is removed it must also be removed from Sale.

IC-7: Customers can only pay for the Sale of an Order they have placed themselves.

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{customer.name} \big( (\sigma_{order.date="2023"} (order) \bowtie  \sigma_{product.price>50} (product)) \bowtie customer \big)$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$\Pi_{employee.name} \big( (\sigma_{workplace.address=Warehouse - workplace.address=Office}(works) \bowtie \sigma_{order.date="January 2023"} (process)) \bowtie employee  \big)$

3. Indique o nome do produto mais vendido;

$\Pi_{name}(Product) - \Pi_{product.name} \big( \sigma_{c1.qty < c2.qty} ( \rho_{c1} contains \times \rho_{c2} contains) \bowtie Product \big)$

4. Indique o valor total de cada venda realizada.

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [5]:
%reload_ext sql
%sql postgresql://db:db@postgres/db

In [6]:
%%sql

DROP TABLE Employee, Workplace, Department, Works, Office, Warehouse, Product, Supplier, EanProduct, Delivery, Customer, Orders, Process, Contains, Sale;

CREATE TABLE IF NOT EXISTS Employee(
    ssn NUMERIC(12) PRIMARY KEY,
    tin NUMERIC(12) UNIQUE,
    bdate DATE,
    name VARCHAR(80)
);

CREATE TABLE IF NOT EXISTS Workplace(
    address VARCHAR(80) PRIMARY KEY,
    lat FLOAT,
    long FLOAT,
    UNIQUE(lat, long)
);

CREATE TABLE IF NOT EXISTS Department(
    name VARCHAR(80) PRIMARY KEY
);

CREATE TABLE IF NOT EXISTS Works(
    ssn NUMERIC(12) REFERENCES Employee,
    address VARCHAR(80) REFERENCES Workplace,
    name VARCHAR(80) REFERENCES Department,
    PRIMARY KEY (ssn, address, name)
);

CREATE TABLE IF NOT EXISTS Office(
    address VARCHAR(80) PRIMARY KEY,
    FOREIGN KEY (address) REFERENCES Workplace (address)
);

CREATE TABLE IF NOT EXISTS Warehouse(
    address VARCHAR(80) PRIMARY KEY,
    FOREIGN KEY (address) REFERENCES Workplace (address)
);

CREATE TABLE IF NOT EXISTS Product(
    sku NUMERIC(8) PRIMARY KEY,
    name VARCHAR(80),
    description VARCHAR(80),
    price FLOAT
);

CREATE TABLE IF NOT EXISTS Supplier(
    tin NUMERIC(12) PRIMARY KEY,
    sku NUMERIC(8) NOT NULL REFERENCES Product,
    name VARCHAR(80),
    address VARCHAR(80),
    date DATE
);

CREATE TABLE IF NOT EXISTS EanProduct(
    sku NUMERIC(8) PRIMARY KEY,
    ean NUMERIC(13)
);

CREATE TABLE IF NOT EXISTS Delivery(
    address VARCHAR(80) REFERENCES Workplace,
    sku NUMERIC(8) REFERENCES Product, 
    tin NUMERIC(12) REFERENCES Supplier, 
    PRIMARY KEY (address, sku, tin)
);

CREATE TABLE IF NOT EXISTS Customer(
    cust_no NUMERIC(20) PRIMARY KEY,
    name VARCHAR(80),
    email VARCHAR(80) UNIQUE,
    phone NUMERIC(12),
    address VARCHAR(80)
);

CREATE TABLE IF NOT EXISTS Orders(
    order_no NUMERIC(20) PRIMARY KEY, 
    cust_no NUMERIC(20) NOT NULL REFERENCES Customer,
    date DATE
);


CREATE TABLE IF NOT EXISTS Process(
    ssn NUMERIC(12) REFERENCES Employee,
    order_no NUMERIC(20) REFERENCES Orders,
    PRIMARY KEY (ssn, order_no)
);

CREATE TABLE IF NOT EXISTS Contains(
    order_no NUMERIC(20) REFERENCES Orders,
    sku NUMERIC(8) REFERENCES Product,
    qty NUMERIC(20),
    PRIMARY KEY (order_no, sku)
);

CREATE TABLE IF NOT EXISTS Sale(
    order_no NUMERIC(20) PRIMARY KEY REFERENCES Orders,
    cust_no NUMERIC(20) NOT NULL REFERENCES Customer
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [7]:
%%sql
-- populate.sql

-- INSERT ...



INSERT INTO Employee (ssn, tin, bdate, name) 
VALUES (111111111, 123123123, '2003-08-12', 'Empregado 1'),
       (222222222, 456456456, '2003-04-25', 'Empregado 2'),
       (333333333, 789789789, '2003-04-26', 'Empregado 3'),
       (444444444, 987987987, '2002-10-02', 'Empregado 4'),
       (555555555, 678678678, '2001-09-04', 'Empregado 5'),
       (666666666, 567567567, '2000-08-07', 'Empregado 6'),
       (777777777, 890890890, '1998-07-06', 'Empregado 7'),
       (888888888, 345345345, '1999-06-10', 'Empregado 8'),
       (999999999, 234234234, '1990-05-20', 'Empregado 9'); 

INSERT INTO Workplace(address, lat, long)
VALUES ('Morada Local Trabalho 1', 21.738, -78.019),
       ('Morada Local Trabalho 2', 09.883, 91.291),
       ('Morada Local Trabalho 3', 77.210, -32.009),
       ('Morada Local Trabalho 4', 44.444, 22.912),
       ('Morada Local Trabalho 5', -65.921, 33.092),
       ('Morada Local Trabalho 6', -03.123, -45.921),
       ('Morada Local Trabalho 7', 09.832, 12.092),
       ('Morada Local Trabalho 8', 33.212, -03.999),
       ('Morada Local Trabalho 9', 35.721, -98.112),
       ('Morada Local Trabalho 10', 22.111, -87.001),
       ('Morada Local Trabalho 11', -53.444, 12.111),
       ('Morada Local Trabalho 12', -29.212, -42.111);

INSERT INTO Department(name)
VALUES ('Operations'),
       ('IT'),
       ('Logistics'),
       ('Marketing'),
       ('Sales'),
       ('Finance'),
       ('HR'),
       ('Legal'),
       ('R&D');

INSERT INTO Works(ssn, address, name)
VALUES (111111111, 'Morada Local Trabalho 1', 'Operations'),
       (222222222, 'Morada Local Trabalho 2', 'Marketing'),
       (333333333, 'Morada Local Trabalho 3', 'IT'),
       (444444444, 'Morada Local Trabalho 4', 'Finance'),
       (555555555, 'Morada Local Trabalho 5', 'R&D'),
       (666666666, 'Morada Local Trabalho 6', 'HR'),
       (777777777, 'Morada Local Trabalho 7', 'IT'),
       (888888888, 'Morada Local Trabalho 8', 'Legal'),
       (999999999, 'Morada Local Trabalho 9', 'IT');

INSERT INTO Office(address)
VALUES ('Morada Local Trabalho 1'),
       ('Morada Local Trabalho 2'),
       ('Morada Local Trabalho 3'),
       ('Morada Local Trabalho 4'),
       ('Morada Local Trabalho 5'),
       ('Morada Local Trabalho 6');

INSERT INTO Warehouse(address)
VALUES ('Morada Local Trabalho 7'),
       ('Morada Local Trabalho 8'),
       ('Morada Local Trabalho 9'),
       ('Morada Local Trabalho 10'),
       ('Morada Local Trabalho 11'),
       ('Morada Local Trabalho 12');

INSERT INTO Product(sku, name, description, price)
VALUES (11122233, 'Produto 1', 'Descricao Produto 1', 5.49),
       (22233344, 'Produto 2', 'Descricao Produto 2', 10.79),
       (33344455, 'Produto 3', 'Descricao Produto 3', 199.98),
       (44455566, 'Produto 4', 'Descricao Produto 4', 0.99),
       (55566677, 'Produto 5', 'Descricao Produto 5', 3.98),
       (66677788, 'Produto 6', 'Descricao Produto 6', 4.49),
       (77788899, 'Produto 7', 'Descricao Produto 7', 59.99),
       (88899900, 'Produto 8', 'Descricao Produto 8', 299.99),
       (99900011, 'Produto 9', 'Descricao Produto 9', 1099.99);

INSERT INTO Supplier(tin, sku, name, address, date)
VALUES (987332121, 11122233, 'Nome Fornecedor 1', 'Endereço Fornecedor 1', '2020-01-01'),
       (999777532, 22233344, 'Nome Fornecedor 2', 'Endereço Fornecedor 2', '2023-01-06'),
       (111998212, 33344455, 'Nome Fornecedor 3', 'Endereço Fornecedor 3', '2022-04-29'),
       (987654321, 44455566, 'Nome Fornecedor 4', 'Endereço Fornecedor 4', '2021-02-28'),
       (987612341, 55566677, 'Nome Fornecedor 5', 'Endereço Fornecedor 5', '2020-03-01'),
       (123333333, 66677788, 'Nome Fornecedor 6', 'Endereço Fornecedor 6', '2020-03-01'),
       (123444444, 77788899, 'Nome Fornecedor 7', 'Endereço Fornecedor 7', '2020-03-01'),
       (123555555, 88899900, 'Nome Fornecedor 8', 'Endereço Fornecedor 8', '2020-03-01'),
       (123666666, 99900011, 'Nome Fornecedor 9', 'Endereço Fornecedor 9', '2020-03-01');

INSERT INTO EanProduct(sku, ean)
VALUES (11122233, 9876543219999),
       (22233344, 9876123412222),
       (33344455, 9876123413333),
       (44455566, 9876123414444),
       (55566677, 9876123415555),
       (66677788, 9876123416666),
       (77788899, 9876123417777);

INSERT INTO Delivery(address, sku, tin)
VALUES ('Morada Local Trabalho 1', 11122233, 111998212),
       ('Morada Local Trabalho 2', 22233344, 987332121),
       ('Morada Local Trabalho 3', 33344455, 987332121),
       ('Morada Local Trabalho 4', 44455566, 987332121),
       ('Morada Local Trabalho 5', 55566677, 987332121),
       ('Morada Local Trabalho 6', 66677788, 987332121),
       ('Morada Local Trabalho 7', 77788899, 987332121),
       ('Morada Local Trabalho 8', 88899900, 987332121),
       ('Morada Local Trabalho 9', 99900011, 987332121);

INSERT INTO Customer(cust_no, name, email, phone, address)
VALUES (1990, 'Nome Cliente 1', 'emailcliente1@hotmail.com', 919821223, 'Morada Cliente 1'),
       (1991, 'Nome Cliente 2', 'emailcliente2@gmail.com', 969988190, 'Morada Cliente 2'),
       (1992, 'Nome Cliente 3', 'emailcliente3@yahoo.com', 921006124, 'Morada Cliente 3'),
       (1993, 'Nome Cliente 4', 'emailcliente4@gmail.com', 919872193, 'Morada Cliente 4'),
       (1994, 'Nome Cliente 5', 'emailcliente5@gmail.com', 927168900, 'Morada Cliente 5'),
       (1995, 'Nome Cliente 6', 'emailcliente6@gmail.com', 912054123, 'Morada Cliente 6'),
       (1996, 'Nome Cliente 7', 'emailcliente7@gmail.com', 960183321, 'Morada Cliente 7'),
       (1997, 'Nome Cliente 8', 'emailcliente8@gmail.com', 915678212, 'Morada Cliente 8'),
       (1998, 'Nome Cliente 9', 'emailcliente9@gmail.com', 918345678, 'Morada Cliente 9');

INSERT INTO Orders(order_no, cust_no, date)
VALUES (1, 1990, '2021-05-25'),
       (2, 1990, '2021-05-27'),
       (3, 1992, '2023-03-21'),
       (4, 1991, '2021-07-03'),
       (5, 1993, '2020-03-20'),
       (6, 1994, '2022-01-10'),
       (7, 1995, '2023-02-02'),
       (8, 1996, '2022-10-31'),
       (9, 1997, '2021-09-15');

INSERT INTO Process(ssn, order_no)
VALUES (111111111, 1),
       (333333333, 2),
       (333333333, 3),
       (444444444, 9),
       (555555555, 7),
       (666666666, 6),
       (777777777, 8),
       (888888888, 4),
       (999999999, 5);

INSERT INTO Contains(order_no, sku, qty)
VALUES (1, 11122233, 10),
       (1, 22233344, 2),
       (1, 33344455, 7),
       (2, 22233344, 200),
       (3, 11122233, 1000),
       (3, 33344455, 5),
       (4, 44455566, 1),
       (4, 55566677, 2),
       (4, 66677788, 20),
       (5, 11122233, 7),
       (5, 66677788, 6),
       (6, 77788899, 21),
       (7, 77788899, 300),
       (7, 99900011, 100),
       (8, 55566677, 50),
       (8, 99900011, 300),
       (9, 11122233, 100),
       (9, 33344455, 200),
       (9, 88899900, 12);

INSERT INTO Sale (order_no, cust_no)
VALUES (1, 1990),
       (2, 1993),
       (3, 1992),
       (4, 1991),
       (7, 1995),
       (9, 1998);

*  postgresql://db:***@postgres/db
9 rows affected.
12 rows affected.
9 rows affected.
9 rows affected.
6 rows affected.
6 rows affected.
9 rows affected.
9 rows affected.
7 rows affected.
9 rows affected.
9 rows affected.
9 rows affected.
9 rows affected.
19 rows affected.
6 rows affected.

[]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [40]:
%%sql
 
SELECT DISTINCT Customer.name 
FROM Customer
JOIN Orders ON Orders.cust_no = Customer.cust_no
JOIN Contains ON Orders.order_no = Contains.order_no
JOIN Product ON Contains.sku = Product.sku
WHERE EXTRACT(YEAR FROM Orders.date) = '2023' AND Product.price > 50

*  postgresql://db:***@postgres/db
2 rows affected.

[('Nome Cliente 5',), ('Nome Cliente 7',)]

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [38]:
%%sql

SELECT Employee.name
FROM Employee 
JOIN Works ON Employee.ssn = Works.ssn
JOIN Warehouse ON Works.address = Warehouse.address
LEFT JOIN Office ON Works.address = Office.address
WHERE Office.address IS NULL;

*  postgresql://db:***@postgres/db
3 rows affected.

[('Empregado 7',), ('Empregado 8',), ('Empregado 9',)]

3. Indique o nome do produto mais vendido;

In [25]:
%%sql

SELECT Product.name 
FROM Product
JOIN (
    SELECT totalQuantities.sku, MAX(totalQuantities.totalQuantity) AS maxQuantity
    FROM (
        SELECT Contains.sku, SUM(Contains.qty) AS totalQuantity
        FROM Contains
        GROUP BY Contains.sku
    ) totalQuantities 
) maxSelect ON maxSelect.sku = Product.sku

-- SELECT ...

*  postgresql://db:***@postgres/db
(psycopg2.errors.GroupingError) column "totalquantities.sku" must appear in the GROUP BY clause or be used in an aggregate function
LINE 4:     SELECT totalQuantities.sku, MAX(totalQuantities.totalQua...
                   ^

[SQL: SELECT Product.name
FROM Product
JOIN (
    SELECT totalQuantities.sku, MAX(totalQuantities.totalQuantity) AS maxQuantity
    FROM (
        SELECT Contains.sku, SUM(Contains.qty) AS totalQuantity
        FROM Contains
        GROUP BY Contains.sku
    ) totalQuantities
) maxSelect ON maxSelect.sku = Product.sku

-- SELECT ...]
(Background on this error at: https://sqlalche.me/e/20/f405)

4. Indique o valor total de cada venda realizada.

In [15]:
%%sql

SELECT Sale.order_no AS saleNumber, SUM(Orders.order_no 
FROM Product
JOIN Contains ON Product.sku = Contains.sku
JOIN Orders ON Orders.order_no = Contains.order_no
JOIN Sale ON Orders.order_no = Sale.order_no
GROUP BY Product.sku


-- SELECT ...

*  postgresql://db:***@postgres/db
9 rows affected.

[(Decimal('44455566'), 0.99),
 (Decimal('77788899'), 17997.0),
 (Decimal('66677788'), 89.80000000000001),
 (Decimal('88899900'), 3599.88),
 (Decimal('11122233'), 6093.900000000001),
 (Decimal('22233344'), 2179.58),
 (Decimal('99900011'), 109999.0),
 (Decimal('55566677'), 7.96),
 (Decimal('33344455'), 42395.759999999995)]